app/controllers/products_controller.rb

INSERT INTO "products" ("name", "quantity", "price_in_cents", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Produto teste"], ["quantity", 123], ["price_in_cents", 10000], ["created_at", "2023-02-28 14:06:17.452104"], ["updated_at", "2023-02-28 14:06:17.452104"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save