app/controllers/products_controller.rb

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 980190962]]
---
  def destroy
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_product
      @product = Product.find(params[:id])