app/controllers/sales_controller.rb

DELETE FROM "sales" WHERE "sales"."id" = $1  [["id", 980190962]]
---
  def destroy
    @sale.destroy

SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_sale
      @sale = Sale.find(params[:id])