app/controllers/sales_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sales" ("quantity", "total_in_cents", "product_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["quantity", 3], ["total_in_cents", 30000], ["product_id", 1], ["user_id", 1], ["created_at", "2023-02-28 14:28:33.292860"], ["updated_at", "2023-02-28 14:28:33.292860"]]
UPDATE "products" SET "quantity" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["quantity", 120], ["updated_at", "2023-02-28 14:28:33.300021"], ["id", 1]]
---
  def create
    @sale = Sale.new(sale_params)
    product = Product.find(sale_params[:product_id])
    if product.quantity < sale_params[:quantity]
      return render json: { message: 'Sem produtos em estoque.'}, status: :unprocessable_entity
    end

    @sale.total_in_cents = product.price_in_cents * sale_params[:quantity]

    if @sale.save
      product.quantity -= sale_params[:quantity]
      product.save!