app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 980190962]]
---
  def destroy
    @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])